## Introduction to Pandas

**pandas** is a Python package providing fast, flexible, and expressive data structures designed to make working with “relational” or “labeled” data both easy and intuitive. It aims to be the fundamental high-level building block for doing practical, real world data analysis in Python. Additionally, it has the broader goal of becoming **the most powerful and flexible open source data analysis / manipulation tool available in any language**. It is already well on its way toward this goal.

pandas is well suited for many different kinds of data:
* Tabular data with heterogeneously-typed columns, as in an SQL table or Excel spreadsheet
* Ordered and unordered (not necessarily fixed-frequency) time series data.
* Arbitrary matrix data (homogeneously typed or heterogeneous) with row and column labels
* Any other form of observational / statistical data sets. The data actually need not be labeled at all to be placed into a pandas data structure

The two primary data structures of pandas - *Series* (1-dimensional) and *DataFrame* (2-dimensional), handle the vast majority of typical use cases in finance, statistics, social science, and many areas of engineering. For R users, DataFrame provides everything that R’s data.frame provides and much more. pandas is built on top of NumPy and is intended to integrate well within a scientific computing environment with many other 3rd party libraries.

Here are just a few of the things that pandas does well:
* Easy handling of missing data (represented as NaN) in floating point as well as non-floating point data
* Size mutability: columns can be inserted and deleted from DataFrame and higher dimensional objects
* Powerful, flexible group by functionality to perform split-apply-combine operations on data sets, for both aggregating and transforming data
* Intelligent label-based slicing, fancy indexing, and subsetting of large data sets
* Intuitive merging and joining data sets
* Flexible reshaping and pivoting of data sets
* Robust IO tools for loading data from flat files (CSV and delimited), Excel files, databases, and saving / loading data from the ultrafast HDF5 format
* Time series-specific functionality: date range generation and frequency conversion, moving window statistics, moving window linear regressions, date shifting and lagging, etc.

Many of these principles are here to address the shortcomings frequently experienced using other languages / scientific research environments. For data scientists, working with data is typically divided into multiple stages: munging and cleaning data, analyzing / modeling it, then organizing the results of the analysis into a form suitable for plotting or tabular display. pandas is the ideal tool for all of these tasks.

Some other notes
* **pandas** is fast. Many of the low-level algorithmic bits have been extensively tweaked in Cython code. However, as with anything else generalization usually sacrifices performance. So if you focus on one feature for your application you may be able to create a faster specialized tool.
* pandas is a dependency of statsmodels, making it an important part of the statistical computing ecosystem in Python.
* pandas has been used extensively in production in financial applications.

<br>

## Representation

All data is loaded directly into the RAM and is optimised to use memory efficiently. The data in memory can be thought of as below:

| column1 | column2 | Gender |
| -------- | -------- | -------- |
| Allen | Varghese | Male |
| Kevin | O'Brien | Male |
| Mihai | Todor | Male |


The main data structure in **pandas** is **DataFrame** which manages data in the above format and is accessible for computation as a python **dictionary**. Lets create the above information as a pandas dataframe.

In [2]:
import pandas as pd

In [3]:
# Create a python dictionary
data = {
    "column1": ["Allen", "Kevin", "Mihai"],
    "column2": ["Varghese", "O'Brien", "Todor"],
    "Gender": ["Male", "Male", "Male"],
    "some_random_numbers": [4200, 2750, 3820]
}

# Create the DataFrame
df = pd.DataFrame(data)
df

  column1   column2 Gender  some_random_numbers
0   Allen  Varghese   Male                 4200
1   Kevin   O'Brien   Male                 2750
2   Mihai     Todor   Male                 3820

An `index` column is added automatically by pandas. This is to keep track of rows and for fast manipulation of data by easy slicing. Individual rows can be accessed by the index.

In [36]:
df.loc[1]

column1                  Kevin
column2                O'Brien
Gender                    Male
some_random_numbers       2750
Name: 1, dtype: object

In [37]:
df["column1"]

0    Allen
1    Kevin
2    Mihai
Name: column1, dtype: object

In [38]:
# Convert to a Numpy array
df["column1"].values

array(['Allen', 'Kevin', 'Mihai'], dtype=object)

In [39]:
# Convert to a Python list
df["column1"].tolist()

['Allen', 'Kevin', 'Mihai']

**NOTE:** Data in a pandas DataFrame is linked as a collection of columns rather than a collection of rows. Thus it is very
fast to access and manipulate data in columns rather than rows. It is important to use appropriate data modelling
techniques to convert available data into a more accessible format

<br>

## Inspecting DataFrames

Below are some useful DataFrame inspection functions

In [40]:
# Summary of the dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   column1              3 non-null      object
 1   column2              3 non-null      object
 2   Gender               3 non-null      object
 3   some_random_numbers  3 non-null      int64
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

In [41]:
# Get the columns
df.columns

Index(['column1', 'column2', 'Gender', 'some_random_numbers'], dtype='object')

In [42]:
# Get the columns as a Python list
df.columns.tolist()

['column1', 'column2', 'Gender', 'some_random_numbers']

In [43]:
# You can also use the Python function `list`
list(df.columns)

['column1', 'column2', 'Gender', 'some_random_numbers']

In [44]:
# Get the index
df.index

RangeIndex(start=0, stop=3, step=1)

In [45]:
# Sneak peek. Displays the first 5 rows by default
df.head()

  column1   column2 Gender  some_random_numbers
0   Allen  Varghese   Male                 4200
1   Kevin   O'Brien   Male                 2750
2   Mihai     Todor   Male                 3820

In [46]:
# Summary Statistics
df.describe()

       some_random_numbers
count             3.000000
mean           3590.000000
std             751.864349
min            2750.000000
25%            3285.000000
50%            3820.000000
75%            4010.000000
max            4200.000000

In [47]:
# Extract a specific row
df.describe().loc["25%"]

some_random_numbers    3285.0
Name: 25%, dtype: float64

In [48]:
# Display the first row
df.head(1)

  column1   column2 Gender  some_random_numbers
0   Allen  Varghese   Male                 4200

In [49]:
# Display the last row
df.tail(1)

  column1 column2 Gender  some_random_numbers
2   Mihai   Todor   Male                 3820

In [50]:
# Number of rows in a DataFrame
len(df)

3

For looking up details about a DataFrame or a function use "dir" or "help"

In [ ]:
dir(df)

In [ ]:
help(df.loc)

<br>

## Manipulating Data

Adding and removing columns from a DataFrame can be done on the fly and makes data manipulation very easy

In [51]:
df

  column1   column2 Gender  some_random_numbers
0   Allen  Varghese   Male                 4200
1   Kevin   O'Brien   Male                 2750
2   Mihai     Todor   Male                 3820

In [52]:
# Assigning a new column by using an equal length Python list
# assigned to a new column
df["Location"] = ["Dublin", "Limerick", "Dublin"]
df

  column1   column2 Gender  some_random_numbers  Location
0   Allen  Varghese   Male                 4200    Dublin
1   Kevin   O'Brien   Male                 2750  Limerick
2   Mihai     Todor   Male                 3820    Dublin

In [53]:
# A subset of columns can be extracted from a DataFrame to remove extra columns
name_df = df[["column1", "column2"]]
name_df

  column1   column2
0   Allen  Varghese
1   Kevin   O'Brien
2   Mihai     Todor

In [54]:
# Rename columns
name_df = name_df.rename(
    columns={
        "column1": "First Name",
        "column2": "Last Name"
    }
)
name_df

  First Name Last Name
0      Allen  Varghese
1      Kevin   O'Brien
2      Mihai     Todor

In [55]:
# Extract the 1st letter of first name
name_df["FN_1"] = name_df["First Name"].map(lambda x: x[0])
name_df

  First Name Last Name FN_1
0      Allen  Varghese    A
1      Kevin   O'Brien    K
2      Mihai     Todor    M

In [56]:
# TODO: Extract the last 3 letters of Last Name in a new column "LN_3"
name_df["LN_3"] = name_df["Last Name"].map(lambda x: x[-3:])
name_df

  First Name Last Name FN_1 LN_3
0      Allen  Varghese    A  ese
1      Kevin   O'Brien    K  ien
2      Mihai     Todor    M  dor

### Load Data

Data can be loaded from external sources like CSV files, Excel and databases.

In [4]:
csv_df = pd.read_csv("datasets/weather_2012.csv")
csv_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8784 entries, 0 to 8783
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Date/Time           8784 non-null   object
 1   Temp (C)            8784 non-null   float64
 2   Dew Point Temp (C)  8784 non-null   float64
 3   Rel Hum (%)         8784 non-null   int64
 4   Wind Spd (km/h)     8784 non-null   int64
 5   Visibility (km)     8784 non-null   float64
 6   Stn Press (kPa)     8784 non-null   float64
 7   Weather             8784 non-null   object
dtypes: float64(4), int64(2), object(2)
memory usage: 549.1+ KB

In [5]:
csv_df.head()

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8.0,101.24,Fog
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8.0,101.24,Fog
2,2012-01-01 02:00:00,-1.8,-3.4,89,7,4.0,101.26,"Freezing Drizzle,Fog"
3,2012-01-01 03:00:00,-1.5,-3.2,88,6,4.0,101.27,"Freezing Drizzle,Fog"
4,2012-01-01 04:00:00,-1.5,-3.3,88,7,4.8,101.23,Fog

In [6]:
csv_df["Weather"].unique()

array(['Fog', 'Freezing Drizzle,Fog', 'Mostly Cloudy', 'Cloudy', 'Rain',
       'Rain Showers', 'Mainly Clear', 'Snow Showers', 'Snow', 'Clear',
       'Freezing Rain,Fog', 'Freezing Rain', 'Freezing Drizzle',
       'Rain,Snow', 'Moderate Snow', 'Freezing Drizzle,Snow',
       'Freezing Rain,Snow Grains', 'Snow,Blowing Snow', 'Freezing Fog',
       'Haze', 'Rain,Fog', 'Drizzle,Fog', 'Drizzle',
       'Freezing Drizzle,Haze', 'Freezing Rain,Haze', 'Snow,Haze',
       'Snow,Fog', 'Snow,Ice Pellets', 'Rain,Haze', 'Thunderstorms,Rain',
       'Thunderstorms,Rain Showers', 'Thunderstorms,Heavy Rain Showers',
       'Thunderstorms,Rain Showers,Fog', 'Thunderstorms',
       'Thunderstorms,Rain,Fog',
       'Thunderstorms,Moderate Rain Showers,Fog', 'Rain Showers,Fog',
       'Rain Showers,Snow Showers', 'Snow Pellets', 'Rain,Snow,Fog',
       'Moderate Rain,Fog', 'Freezing Rain,Ice Pellets,Fog',
       'Drizzle,Ice Pellets,Fog', 'Drizzle,Snow', 'Rain,Ice Pellets',
       'Drizzle,Snow,Fog', 'Rain,Snow Grains', 'Rain,Snow,Ice Pellets',
       'Snow Showers,Fog', 'Moderate Snow,Blowing Snow'], dtype=object)

<br>

## Filtering data

In [7]:
csv_df["Weather"].str.contains("Rain")

0       False
1       False
2       False
3       False
4       False
        ...
8779    False
8780    False
8781    False
8782    False
8783    False
Name: Weather, Length: 8784, dtype: bool

In [8]:
csv_df["Weather"][csv_df["Weather"].str.contains("Rain")]

18                   Rain
19                   Rain
22           Rain Showers
24           Rain Showers
153     Freezing Rain,Fog
              ...
8537                 Rain
8538                 Rain
8539                 Rain
8540                 Rain
8541                 Rain
Name: Weather, Length: 689, dtype: object

In [9]:
csv_df["Weather"][csv_df["Weather"].str.contains("Rain")].head(1)

18    Rain
Name: Weather, dtype: object

In [10]:
# Find only "Rain" weather reports
csv_df["Weather"][csv_df["Weather"].str.contains("Rain")].unique()

array(['Rain', 'Rain Showers', 'Freezing Rain,Fog', 'Freezing Rain',
       'Rain,Snow', 'Freezing Rain,Snow Grains', 'Rain,Fog',
       'Freezing Rain,Haze', 'Rain,Haze', 'Thunderstorms,Rain',
       'Thunderstorms,Rain Showers', 'Thunderstorms,Heavy Rain Showers',
       'Thunderstorms,Rain Showers,Fog', 'Thunderstorms,Rain,Fog',
       'Thunderstorms,Moderate Rain Showers,Fog', 'Rain Showers,Fog',
       'Rain Showers,Snow Showers', 'Rain,Snow,Fog', 'Moderate Rain,Fog',
       'Freezing Rain,Ice Pellets,Fog', 'Rain,Ice Pellets',
       'Rain,Snow Grains', 'Rain,Snow,Ice Pellets'], dtype=object)

In [11]:
# Find rows that has weather value as "Fog"
csv_df[csv_df["Weather"] == "Fog"]

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8.0,101.24,Fog
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8.0,101.24,Fog
4,2012-01-01 04:00:00,-1.5,-3.3,88,7,4.8,101.23,Fog
5,2012-01-01 05:00:00,-1.4,-3.3,87,9,6.4,101.27,Fog
6,2012-01-01 06:00:00,-1.5,-3.1,89,7,6.4,101.29,Fog
...,...,...,...,...,...,...,...,...
8716,2012-12-29 04:00:00,-16.0,-17.2,90,6,9.7,101.25,Fog
8717,2012-12-29 05:00:00,-14.8,-15.9,91,4,6.4,101.25,Fog
8718,2012-12-29 06:00:00,-13.8,-15.3,88,4,9.7,101.25,Fog
8719,2012-12-29 07:00:00,-14.8,-16.4,88,7,8.0,101.22,Fog
8722,2012-12-29 10:00:00,-12.0,-13.3,90,7,6.4,101.15,Fog

In [12]:
# Find rows where temperature is more than 10 deg C
csv_df[csv_df["Temp (C)"] > 10.0]

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
1600,2012-03-07 16:00:00,11.4,-2.3,38,15,24.1,101.31,Mostly Cloudy
1611,2012-03-08 03:00:00,10.1,-0.9,46,24,25.0,100.69,Mostly Cloudy
1615,2012-03-08 07:00:00,10.3,0.8,52,26,48.3,100.47,Cloudy
1617,2012-03-08 09:00:00,10.2,1.6,55,26,48.3,100.29,Cloudy
1618,2012-03-08 10:00:00,12.1,2.9,53,30,24.1,100.22,Cloudy
...,...,...,...,...,...,...,...,...
8128,2012-12-04 16:00:00,10.7,7.9,83,24,19.3,100.64,Cloudy
8129,2012-12-04 17:00:00,10.8,8.1,83,30,25.0,100.55,Cloudy
8130,2012-12-04 18:00:00,10.7,8.2,85,32,25.0,100.50,Cloudy
8131,2012-12-04 19:00:00,10.7,8.4,86,7,25.0,100.57,Rain Showers
8133,2012-12-04 21:00:00,10.4,9.7,95,9,6.4,100.56,Rain

In [13]:
# Find rows where temperature is more than 10 deg C and Weather is either `Cloudy` or `Clear`
csv_df[(csv_df["Temp (C)"] > 10.0) & (csv_df["Weather"].isin(["Cloudy", "Clear"]))]

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
1615,2012-03-08 07:00:00,10.3,0.8,52,26,48.3,100.47,Cloudy
1617,2012-03-08 09:00:00,10.2,1.6,55,26,48.3,100.29,Cloudy
1618,2012-03-08 10:00:00,12.1,2.9,53,30,24.1,100.22,Cloudy
1619,2012-03-08 11:00:00,12.7,3.8,55,26,24.1,100.13,Cloudy
1621,2012-03-08 13:00:00,11.5,5.2,65,20,24.1,99.99,Cloudy
...,...,...,...,...,...,...,...,...
8126,2012-12-04 14:00:00,11.3,8.1,81,24,24.1,100.74,Cloudy
8127,2012-12-04 15:00:00,11.0,7.9,81,24,24.1,100.66,Cloudy
8128,2012-12-04 16:00:00,10.7,7.9,83,24,19.3,100.64,Cloudy
8129,2012-12-04 17:00:00,10.8,8.1,83,30,25.0,100.55,Cloudy
8130,2012-12-04 18:00:00,10.7,8.2,85,32,25.0,100.50,Cloudy

In [14]:
# Group by on "Weather" column and count the number of records for each category
weather_grpby = csv_df.groupby("Weather")["Dew Point Temp (C)"].count()
weather_grpby

Weather
Clear                                      1326
Cloudy                                     1728
Drizzle                                      41
Drizzle,Fog                                  80
Drizzle,Ice Pellets,Fog                       1
Drizzle,Snow                                  2
Drizzle,Snow,Fog                             15
Fog                                         150
Freezing Drizzle                              7
Freezing Drizzle,Fog                          6
Freezing Drizzle,Haze                         3
Freezing Drizzle,Snow                        11
Freezing Fog                                  4
Freezing Rain                                14
Freezing Rain,Fog                             4
Freezing Rain,Haze                            2
Freezing Rain,Ice Pellets,Fog                 1
Freezing Rain,Snow Grains                     1
Haze                                         16
Mainly Clear                               2106
Moderate Rain,Fog                             1
Moderate Snow                                 4
Moderate Snow,Blowing Snow                    2
Mostly Cloudy                              2069
Rain                                        306
Rain Showers                                188
Rain Showers,Fog                              1
Rain Showers,Snow Showers                     2
Rain,Fog                                    116
Rain,Haze                                     3
Rain,Ice Pellets                              1
Rain,Snow                                    18
Rain,Snow Grains                              1
Rain,Snow,Fog                                 1
Rain,Snow,Ice Pellets                         4
Snow                                        390
Snow Pellets                                  1
Snow Showers                                 60
Snow Showers,Fog                              4
Snow,Blowing Snow                            19
Snow,Fog                                     37
Snow,Haze                                     5
Snow,Ice Pellets                              6
Thunderstorms                                 2
Thunderstorms,Heavy Rain Showers              1
Thunderstorms,Moderate Rain Showers,Fog       1
Thunderstorms,Rain                            3
Thunderstorms,Rain Showers                   16
Thunderstorms,Rain Showers,Fog                3
Thunderstorms,Rain,Fog                        1
Name: Dew Point Temp (C), dtype: int64

The above output is a Series with the unique values in the `Weather` column.

In [16]:
# Get the output of a group by condition as a Dataframe
weather_grpby = csv_df.groupby("Weather", as_index=False)["Dew Point Temp (C)"].count()
weather_grpby

                                    Weather  Dew Point Temp (C)
0                                     Clear                1326
1                                    Cloudy                1728
2                                   Drizzle                  41
3                               Drizzle,Fog                  80
4                   Drizzle,Ice Pellets,Fog                   1
5                              Drizzle,Snow                   2
6                          Drizzle,Snow,Fog                  15
7                                       Fog                 150
8                          Freezing Drizzle                   7
9                      Freezing Drizzle,Fog                   6
10                    Freezing Drizzle,Haze                   3
11                    Freezing Drizzle,Snow                  11
12                             Freezing Fog                   4
13                            Freezing Rain                  14
14                        Freezing Rain,Fog                   4
15                       Freezing Rain,Haze                   2
16            Freezing Rain,Ice Pellets,Fog                   1
17                Freezing Rain,Snow Grains                   1
18                                     Haze                  16
19                             Mainly Clear                2106
20                        Moderate Rain,Fog                   1
21                            Moderate Snow                   4
22               Moderate Snow,Blowing Snow                   2
23                            Mostly Cloudy                2069
24                                     Rain                 306
25                             Rain Showers                 188
26                         Rain Showers,Fog                   1
27                Rain Showers,Snow Showers                   2
28                                 Rain,Fog                 116
29                                Rain,Haze                   3
30                         Rain,Ice Pellets                   1
31                                Rain,Snow                  18
32                         Rain,Snow Grains                   1
33                            Rain,Snow,Fog                   1
34                    Rain,Snow,Ice Pellets                   4
35                                     Snow                 390
36                             Snow Pellets                   1
37                             Snow Showers                  60
38                         Snow Showers,Fog                   4
39                        Snow,Blowing Snow                  19
40                                 Snow,Fog                  37
41                                Snow,Haze                   5
42                         Snow,Ice Pellets                   6
43                            Thunderstorms                   2
44         Thunderstorms,Heavy Rain Showers                   1
45  Thunderstorms,Moderate Rain Showers,Fog                   1
46                       Thunderstorms,Rain                   3
47               Thunderstorms,Rain Showers                  16
48           Thunderstorms,Rain Showers,Fog                   3
49                   Thunderstorms,Rain,Fog                   1

Read a dataset with :
* non-typical formatting of CSV data
* different character set encoding
* a date column as the index field

In [17]:
bikes = pd.read_csv(
    'datasets/bikes.csv', sep=';', encoding='latin1',
    parse_dates=['Date'], dayfirst=True, index_col='Date'
)
bikes.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 310 entries, 2012-01-01 to 2012-11-05
Data columns (total 9 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   Berri 1                              310 non-null    int64
 1   Brébeuf (données non disponibles)    0 non-null      float64
 2   Côte-Sainte-Catherine                310 non-null    int64
 3   Maisonneuve 1                        310 non-null    int64
 4   Maisonneuve 2                        310 non-null    int64
 5   du Parc                              310 non-null    int64
 6   Pierre-Dupuy                         310 non-null    int64
 7   Rachel1                              310 non-null    int64
 8   St-Urbain (données non disponibles)  0 non-null      float64
dtypes: float64(2), int64(7)
memory usage: 24.2 KB

In [18]:
bikes.head()

,Berri 1,Brébeuf (données non disponibles),Côte-Sainte-Catherine,Maisonneuve 1,Maisonneuve 2,du Parc,Pierre-Dupuy,Rachel1,St-Urbain (données non disponibles)
Date,,,,,,,,,
2012-01-01,35,NaN,0,38,51,26,10,16,NaN
2012-01-02,83,NaN,1,68,153,53,6,43,NaN
2012-01-03,135,NaN,2,104,248,89,3,58,NaN
2012-01-04,144,NaN,1,116,318,111,8,61,NaN
2012-01-05,197,NaN,2,124,330,97,13,95,NaN

In [19]:
# Make a copy of only the "Berri 1" data
berri_bikes = bikes[['Berri 1']].copy()
berri_bikes.head()

            Berri 1
Date
2012-01-01       35
2012-01-02       83
2012-01-03      135
2012-01-04      144
2012-01-05      197

Next, we need to add a 'weekday' column. Firstly, we can get the weekday from the index. It's basically all the days of the year. Pandas has a bunch of really great time series functionality, so if we wanted to get the day of the month for each row, we could do it like this:

In [20]:
berri_bikes.index.day

Int64Index([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10,
            ...
            27, 28, 29, 30, 31,  1,  2,  3,  4,  5],
           dtype='int64', name='Date', length=310)

We actually want the weekday, though:

In [21]:
berri_bikes.index.weekday

Int64Index([6, 0, 1, 2, 3, 4, 5, 6, 0, 1,
            ...
            5, 6, 0, 1, 2, 3, 4, 5, 6, 0],
           dtype='int64', name='Date', length=310)

These are the days of the week, where 0 is Monday. I found out that 0 was Monday by checking on a calendar.
Now that we know how to get the weekday, we can add it as a column in our dataframe like this:

In [22]:
#berri_bikes.loc[:,'weekday'] = berri_bikes.index.weekday
berri_bikes["weekday"] = berri_bikes.index.weekday

#berri_bikes[:5]
berri_bikes.head()

            Berri 1  weekday
Date
2012-01-01       35        6
2012-01-02       83        0
2012-01-03      135        1
2012-01-04      144        2
2012-01-05      197        3

Adding up cyclists by weekday

In [23]:
weekday_counts = berri_bikes.groupby('weekday').sum()
weekday_counts

         Berri 1
weekday
0         134298
1         135305
2         152972
3         160131
4         141771
5         101578
6          99310

It's hard to remember what 0, 1, 2, 3, 4, 5, 6 mean, so we can fix it up and graph it:

In [24]:
weekday_counts.index = [
    'Monday', 'Tuesday', 'Wednesday', 'Thursday',
    'Friday', 'Saturday', 'Sunday'
]
weekday_counts

           Berri 1
Monday      134298
Tuesday     135305
Wednesday   152972
Thursday    160131
Friday      141771
Saturday    101578
Sunday       99310

In [26]:
# TODO: Repeat the above exercise with Month

In [27]:
berri_bikes.index.month

Int64Index([ 1,  1,  1,  1,  1,  1,  1,  1,  1,  1,
            ...
            10, 10, 10, 10, 10, 11, 11, 11, 11, 11],
           dtype='int64', name='Date', length=310)

In [28]:
berri_bikes["month"] = berri_bikes.index.month
berri_bikes

            Berri 1  weekday  month
Date
2012-01-01       35        6      1
2012-01-02       83        0      1
2012-01-03      135        1      1
2012-01-04      144        2      1
2012-01-05      197        3      1
...             ...      ...    ...
2012-11-01     2405        3     11
2012-11-02     1582        4     11
2012-11-03      844        5     11
2012-11-04      966        6     11
2012-11-05     2247        0     11

[310 rows x 3 columns]

In [29]:
month_counts = berri_bikes.groupby("month").sum()
month_counts

       Berri 1  weekday
month
1         4915       91
2         6712       86
3        26229       96
4        67699       90
5       133274       90
6       144849       93
7       162562       91
8       149227       93
9       127061       95
10       94793       87
11        8044       18

In [30]:
month_counts.index = [
    "January", "February", "March", "April", "May", "June", "July", "August", "September", "October", "November"
]
month_counts

           Berri 1  weekday
January       4915       91
February      6712       86
March        26229       96
April        67699       90
May         133274       90
June        144849       93
July        162562       91
August      149227       93
September   127061       95
October      94793       87
November      8044       18

<br>

## Persistence

Data in a DataFrame can be saved to a file or a database. Lets look at both scenarios.

### Save to File

In [ ]:
weekday_counts

In [ ]:
# Saves all the data including the index
weekday_counts.to_csv("datasets/bike_travel_weekday_count.csv")

In [ ]:
df

In [ ]:
# Save DataFrame without index
df.to_csv("sample_dataset.csv", index=False)

### Save to Database

In [ ]:
import sqlite3
db_conn = sqlite3.connect("workshop_db.sqlite")
df.to_sql("person_details", db_conn, if_exists="replace", index=False)

In [ ]:
df_table = pd.read_sql("select * from person_details", db_conn)
df_table